In [1]:
import pandas as pd

In [2]:
df = pd.read_clipboard()
df

  group  col1  col2
0     a     1     2
1     b     2     1
2     c     1     2
3     b     2     1
4     a     1     1
5     b     1     1
6     c     2     2
7     a     1     1

In [8]:
(
 df.set_index('group')
    .stack()
    .groupby(level = [1,0])
    .apply(pd.Series.value_counts)
    .unstack()
    .fillna(0)
    .astype(int)
)

            1  2
     group
col1 a      3  0
     b      1  2
     c      1  1
col2 a      2  1
     b      3  0
     c      0  2

In [10]:
(
 df.set_index('group')
    .stack()
)

group
a      col1    1
       col2    2
b      col1    2
       col2    1
c      col1    1
       col2    2
b      col1    2
       col2    1
a      col1    1
       col2    1
b      col1    1
       col2    1
c      col1    2
       col2    2
a      col1    1
       col2    1
dtype: int64

In [11]:
(
 df.set_index('group')
    .stack()
    .groupby(level = [1,0])

)

In [12]:
(
 df.set_index('group')
    .stack()
    .groupby(level = [1,0])
    .apply(pd.Series.value_counts)

)

      group
col1  a      1    3
      b      2    2
             1    1
      c      1    1
             2    1
col2  a      1    2
             2    1
      b      1    3
      c      2    2
dtype: int64